
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФНФ_Клиент.ОтправитьСообщениеВнешней(Строка(ВыбраннаяСтрока.УникальныйИдентификатор()) + ":"); // +++ Лучше использовать СтрШаблон
	
КонецПроцедуры

&НаКлиенте
Процедура ВводКоличества(Количество, ДопПараметры) Экспорт
	
	ПоказатьВводЧисла(
		Новый ОписаниеОповещения(
			"ВводКоличестваЗавершение",
			ЭтотОбъект,
			Новый Структура("Количество", Количество)),
		Количество,
		"Укажите количество товара"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВводКоличестваЗавершение(Число, ДополнительныеПараметры) Экспорт
	
	// +++ Два раза выполняется проверка на Неопределено и стоит выделить это в явное условие.
	// То есть будет примерно так:
	// Если Число = Неопределено Тогда
	//		Возврат;
	// КонецЕсли;
	// УнИд = Строка(Элементы.Список.ТекущаяСтрока.УникальныйИдентификатор());
	// ФНФ_Клиент.ОтправитьСообщениеВнешней(УнИд + ":" + Формат(Число, "ЧГ="));
	
	Количество = ?(Число = Неопределено, ДополнительныеПараметры.Количество, Число);
	Если (Число <> Неопределено) Тогда
		УнИд = Строка(Элементы.Список.ТекущаяСтрока.УникальныйИдентификатор());
		ФНФ_Клиент.ОтправитьСообщениеВнешней(УнИд + ":" + Формат(Количество, "ЧГ="));
	КонецЕсли;
	
КонецПроцедуры
