
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОткрытьТекущую", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущую()
	
	ФНФ_Клиент.ОткрытьСсылкуВоВложенной(Элементы.ТекущаяНоменклатура, Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПокраситьОписание(Команда)
	
	Диалог = Новый ДиалогВыбораЦвета; 
	Диалог.Показать(Новый ОписаниеОповещения("ПокраситьОписаниеЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог))); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПокраситьОписаниеЗавершение(Цвет, ДополнительныеПараметры) Экспорт
	
	Если (Цвет <> Неопределено) Тогда 
		// +++ Слишком длинная строка
		ФНФ_Клиент.ВыполнитьОповещениеВложенной(Элементы.ТекущаяНоменклатура, "Форма", "ПокраситьОписание", ФНФ_Сервер.СтрокаXML(Цвет));
	КонецЕсли;
	
КонецПроцедуры

